ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
/* Same forward-reference reason as imu_read_raw above - defined near
 * setup_magnetometer() further down, called from uros_task() above that. */
static bool mag_read_raw(int16_t *mx, int16_t *my, int16_t *mz);

/* Moved up from near control_task() (2026-07-27): pid_step() needs this for
 * its dt calculation, but #define order matters in C - the compiler had
 * never actually seen this macro yet at the point pid_step() used it,
 * since the old location was much further down in the file. That was a
 * silent build failure (`'CONTROL_PERIOD_MS' undeclared`), not a subtle
 * bug - every build since Ki was added failed here, meaning any test
 * result since then that "worked" was very likely re-flashing a stale,
 * older binary rather than the code we thought we were testing.
 *
 * Original context for the value itself: shorter window = coarser RPM
 * resolution with only 20 slots/rev. Raised 50ms -> 200ms (2026-07-27):
 * at 50ms, 1 pulse = 60 RPM/step, and a since-changed 30 RPM test target
 * sat exactly BETWEEN two measurable levels - the controller could never
 * read "at target". At 200ms, 1 pulse = 15 RPM/step - finer, though RPM
 * itself no longer depends on this window at all now (see last_interval_us
 * / RPM_STALE_US further down - period measurement replaced pulse
 * counting for the actual RPM value). This constant now only sets how
 * often PID/sync/PWM update, not measurement resolution. */
#define CONTROL_PERIOD_MS 200   /* 5 Hz */

/* --- F3: PI velocity control (Kd deliberately skipped, see KI comment below) --- */
/* TARGET_RPM (hardcoded 30, then 60) retired 2026-07-27 now that F5 wires
 * real /cmd_vel - per-wheel targets are computed live from linear.x/angular.z
 * instead (see the F5 section below). Kept using it through F1-F4 was the
 * right call (needed *some* number to validate the control loop before the
 * real command source existed) - it's just no longer the source of truth. */
/* Kp/Ki/max-integral-contribution converted from #define to live-tunable
 * globals 2026-08-27: raising the mission's speed caps exposed a real
 * steady-state PID weakness (PWM plateauing ~100-130 under real load,
 * never reaching the wheels' true target RPM) - the fixed MAX_I_CONTRIBUTION
 * below was too small to let the integral term close a persistent error on
 * this heavier-than-bench-tested robot. Rather than guess a new fixed
 * number blind and reflash repeatedly, these are now pushed live from the
 * dashboard over /pid_gains (see pid_gains_callback below and the
 * dashboard's PID box in search_and_rescue.py) so they can be tuned against
 * the real load in real time. Defaults are just the starting point - not
 * meant to be the final tuned values anymore. */
static volatile float g_kp = 3.0f;             /* start small, increase until oscillation appears, back off */
static volatile float g_ki = 0.2f;
/* Anti-windup: without SOME limit, integral grows unbounded whenever output
 * is pinned at MIN/MAX_SAFE_PWM (e.g. a stalled wheel), causing a huge
 * overshoot once it frees up. Was a fixed 40.0f contribution cap - too
 * tight for real load, hence live-tunable now too. */
static volatile float g_max_i_contribution = 40.0f;

/* --- Heading control ---
 * Speed regulation is two INDEPENDENT per-wheel PID loops (see control_task)
 * - each wheel converges to its own target from its own measured RPM, with
 * its own integrator, so a real hardware asymmetry (e.g. more friction on
 * one motor) gets corrected at its actual source instead of being inferred
 * indirectly from rotation.
 *
 * Heading correction comes from the gyro, layered on TOP of that: compare
 * the desired turn rate (angular.z, or the heading-lock setpoint below when
 * not actively told to turn) against the MEASURED turn rate
 * (imu_gz_rad_per_s_shared), PROPORTIONAL only (no integral - matches this
 * codebase's own "start simple" philosophy). This shifts each wheel's
 * TARGET (added to one, subtracted from the other, in RPM units - same
 * domain as target_rpm_left/right, so it composes by plain addition), not
 * its PID gain - Kp/Ki only ever affect how hard a wheel's own loop chases
 * its own error, heading correction only ever affects what that target IS.
 * Falls back to trim=0 whenever the IMU read is invalid - never correct off
 * a signal we don't trust. */
static volatile float g_kheading = 15.0f;   /* RPM of trim per rad/s of heading-rate error - live-tunable, see pid_gains_callback */
/* Ceiling on heading_trim_rpm - was a fixed #define (20.0f), too tight once
 * live testing (2026-08-27) showed it silently capping the correction well
 * below what a real heading error needed, with no way to see that from the
 * dashboard. Now live-tunable same as everything else above - set it high
 * (or very high, effectively "off") from the dashboard if a real, sustained
 * heading error needs more authority than the old fixed ceiling allowed. */
static volatile float g_max_heading_trim_rpm = 20.0f;

/* Heading LOCK (position, not rate): g_kheading/g_max_heading_trim_rpm above
 * only correct a RATE mismatch (commanded turn speed vs measured turn
 * speed) - once the robot stops rotating it stops correcting, even if it's
 * now pointed the wrong way. This adds the missing angle term: whenever the
 * commanded angular.z is ~0 (straight driving, or sitting still after a
 * turn), latch the current heading as a target and keep computing a virtual
 * "turn rate" proportional to how far off that target the robot drifts -
 * this virtual rate feeds into the same g_kheading rate loop above (see
 * control_task), reusing it instead of adding a second output path. */
static volatile float g_kheading_lock = 2.0f;          /* virtual rad/s per rad of heading error */
static volatile float g_max_heading_lock_rate = 0.6f;  /* rad/s ceiling on that virtual rate */
/* volatile: written by control_task, read by uros_task for the diag string
 * (same cross-task pattern as pose_theta_shared etc. above). */
static volatile float g_target_heading_rad = 0.0f;
static volatile bool  g_heading_lock_active = false;
#define HEADING_LOCK_DEADBAND_RAD (0.5f * 3.14159265f / 180.0f)  /* ~0.5deg - don't hunt on sensor noise */
#define ANGZ_TURN_DEADBAND 0.02f  /* rad/s - below this, cmd_vel counts as "not turning" */

/* Manual per-wheel PWM trim (2026-08-28) - a flat PWM offset added on top of
 * everything the PID/heading loops already decided, for compensating a
 * mechanically weaker motor (different friction/torque between the two
 * physical motors - not something a speed PID or heading PID is meant to
 * fix, since it's a per-wheel hardware asymmetry, not an error signal).
 * Live-tunable via the same /pid_gains mechanism as Kp/Ki/etc (see
 * pid_gains_callback) - deliberately NOT touched by pid_step's target==0
 * safety bypass (see the commanded_to_move gate at its application site
 * below): a commanded stop must still mean PWM=0, trim included -
 * otherwise a stale/lost /cmd_vel would leave one wheel creeping instead of
 * actually stopping, defeating the whole point of that safety bypass. */
static volatile float g_trim_left = 0.0f;
static volatile float g_trim_right = 0.0f;

