ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
/* Odometry reset request (2026-08-27) - set by pid_gains_callback on the
 * "RESET_ODOM" sentinel command (see below), cleared by control_task once
 * actioned. A plain bool flag between the two tasks, same pattern as the
 * other cross-task shared vars in this file - no lock needed, one writer
 * (uros_task), one reader (control_task), and a torn read of a single bool
 * isn't a real hazard the way the paired pulse-count/timestamp fields are. */
static volatile bool g_reset_odom_requested = false;

/* --- F4: odometry (measured 2026-07-27: wheelbase 10cm; wheel diameter
 * re-measured 2026-08-26 as 6.7cm, corrected from the original 6cm) ---
 * distance per pulse = wheel circumference / slots per rev - converts a raw
 * pulse count directly into linear distance traveled by that wheel.
 * Differential-drive kinematics: center-of-robot distance is the AVERAGE of
 * the two wheels' distances (if both go the same distance, robot moves
 * straight with no turn); heading change is the DIFFERENCE divided by the
 * wheelbase (if right travels further than left, robot rotates toward the
 * left/slower side - matches the direction convention already confirmed
 * earlier today: faster right wheel -> drifts left). */
#define WHEEL_DIAMETER_M 0.067f
#define WHEELBASE_M 0.10f
#define PI_F 3.14159265f   /* not relying on M_PI - not guaranteed defined by every libc without _USE_MATH_DEFINES */
#define WHEEL_CIRCUMFERENCE_M (PI_F * WHEEL_DIAMETER_M)
#define DISTANCE_PER_PULSE_M (WHEEL_CIRCUMFERENCE_M / SLOTS_PER_REV)

static inline float wrap_angle_rad(float a) {
    while (a > PI_F)  a -= 2.0f * PI_F;
    while (a < -PI_F) a += 2.0f * PI_F;
    return a;
}

/* --- F5: /cmd_vel in, /odom out (2026-07-27) ---
 * Safety default: if no /cmd_vel received within this long (agent crash,
 * USB unplugged, Jetson down), treat commanded velocity as 0 rather than
 * keep driving on the last command received - a lost connection must mean
 * "stop", never "keep going blind". Applies both before the first command
 * ever arrives AND if a live connection drops mid-drive. */
#define CMD_VEL_TIMEOUT_US 1000000   /* 1s */

#define ODOM_PUBLISH_PERIOD_MS 100   /* 10 Hz */

static const char *TAG = "control_task";

/* Shared between ISR (writer) and control_task (reader) -> must be volatile
 * so the compiler never caches a stale copy in a register. */
static volatile uint32_t pulse_count_left = 0;
static volatile uint32_t pulse_count_right = 0;

/* Latest computed RPM, exposed for uros_task (F5) to read later. */
static volatile float rpm_left_shared = 0.0f;
static volatile float rpm_right_shared = 0.0f;

/* F5: /cmd_vel, written by uros_task's subscription callback, read by
 * control_task. last_cmd_vel_us is the watchdog clock - see
 * CMD_VEL_TIMEOUT_US comment above. */
static volatile float cmd_linear_x = 0.0f;
static volatile float cmd_angular_z = 0.0f;
static volatile int64_t last_cmd_vel_us = 0;

/* F5: pose + velocity, written by control_task (F4 odometry math), read by
 * uros_task to publish /odom. Plain floats (not the mutex-protected pulse
 * counters) - a torn read here would be a stale/slightly-off reading, not a
 * silently-corrupted control decision, so it's not worth the locking. */
static volatile float pose_x_shared = 0.0f;
static volatile float pose_y_shared = 0.0f;
static volatile float pose_theta_shared = 0.0f;
static volatile float linear_vel_shared = 0.0f;
static volatile float angular_vel_shared = 0.0f;

/* Added for hardware debugging (Alex, one-wheel-not-spinning investigation):
 * applied_pwm_left/right were previously local-only to control_task, so
 * uros_task had no way to report them. Mirrors the rpm_*_shared pattern
 * above. */
static volatile float pwm_left_shared = 0.0f;
static volatile float pwm_right_shared = 0.0f;

/* Gyro-Z heading fusion (2026-08-22), written by uros_task's existing IMU
 * read, read by control_task - same cross-task pattern as rpm_*_shared
 * above. imu_gz_valid_shared is false whenever the most recent read failed
 * (IMU never woke, or the ~20s-uptime read-degradation bug latched imu_dev
 * dead for this boot - see README "Lessons Learned") so control_task can
 * always fail safe back to the original encoder-differential dtheta
 * instead of blending in a stale/garbage gyro value. */
static volatile float imu_gz_rad_per_s_shared = 0.0f;
static volatile bool imu_gz_valid_shared = false;

/* Gyro zero-rate bias, raw LSB units (same units as the int16 gz field
 * imu_read_raw returns) - measured once at boot by calibrate_gyro_bias()
 * (see setup_imu()), subtracted from every raw gz reading before converting
 * to rad/s. MEMS gyros essentially never read exactly zero at rest - a
 * typical uncorrected zero-rate offset is a degree or more per second,
 * which integrates directly into the heading estimate every single cycle,
 * gyro-only or fused. Declared here (before uros_task, which is the first
 * user) for the same declaration-order reason as the other globals above -
 * this file has been bitten by that mistake enough times this session to
 * not risk it again. Only ever written once, at boot, before either task
 * starts - no cross-task synchronization needed. */
static float g_gyro_z_bias_raw = 0.0f;

/* Magnetometer heading fusion (2026-08-28), same cross-task pattern as
 * imu_gz_rad_per_s_shared above - written by uros_task's mag read, read by
 * control_task. mag_heading_valid_shared false means "don't use this",
 * same fail-safe philosophy as imu_gz_valid_shared. Value is already
 * zero-referenced against wherever the robot was pointed at boot (see
 * g_mag_calibrated in uros_task) - NOT a true compass bearing, doesn't need
 * to be one, since this whole system's heading frame is relative/arbitrary
 * (odom frame) to begin with. */
static volatile float mag_heading_rad_shared = 0.0f;
static volatile bool mag_heading_valid_shared = false;

/* Boot-time zero-reference "calibration" (see uros_task's mag_read_raw call
 * site) - only ever touched from within uros_task itself, no cross-task
 * sharing needed, unlike the two above. Declared here (before uros_task,
 * which is the first user of them) for the same declaration-order reason as
 * CONTROL_PERIOD_MS/GYRO_RAW_TO_RAD_PER_S above - this file has been bitten
 * by using-before-declaring before, this is that same bug caught at
 * compile time this round instead of shipping it. */
static float g_mag_heading_offset_rad = 0.0f;
static bool g_mag_calibrated = false;

