ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
/* How strongly each 200ms control cycle nudges pose_theta_shared toward the
 * compass heading. Deliberately small: the gyro should still dominate
 * moment-to-moment (smooth, fast, low-noise), the compass only slowly
 * drags the estimate back when the gyro has drifted - a standard
 * complementary filter. Starting guess, same "start small" philosophy as
 * Kp/Ki above - watch whether long-run drift is actually reduced before
 * tuning this further. */
#define MAG_FUSION_WEIGHT 0.02f

/* MPU6050 power-on-reset default full-scale range: gyro +/-250deg/s at
 * 131 LSB/(deg/s) (same constant jetson/tools/process_imu_raw.py uses
 * off-device). /imu_raw itself stays raw ints by design - this conversion
 * is only for control_task's internal heading math, which needs radians
 * to add directly to pose_theta_shared. Defined here (before uros_task,
 * which is the first user of it) - not down near imu_read_raw() where it
 * conceptually "belongs", to avoid the exact declaration-order bug this
 * file has been bitten by before (CONTROL_PERIOD_MS, 2026-07-27). */
#define GYRO_RAW_TO_RAD_PER_S (PI_F / (180.0f * 131.0f))

/* Number of samples averaged for the boot-time gyro bias calibration (see
 * g_gyro_z_bias_raw / calibration loop in setup_imu()). 100 samples @ ~10ms
 * apart is ~1s total - long enough to average out ordinary sample noise,
 * short enough not to meaningfully delay boot. */
#define GYRO_CAL_SAMPLES 100

/* Spinlock used to make "read + reset" atomic (avoids the lost-pulse race
 * where a pulse arrives between reading the counter and zeroing it). */
static portMUX_TYPE encoder_mux = portMUX_INITIALIZER_UNLOCKED;

/* Debounce: while the motor is actually running (not hand-spun), PWM
 * switching edges and DC-brush arcing couple electrical noise onto the
 * encoder signal line, which the ISR was counting as real slot transitions
 * (confirmed 2026-07-27: hand-spinning gave clean 0-60 RPM, motor-running
 * gave RPM spiking as high as 6300). Reject edges that arrive faster than
 * any real slot transition physically could - at TARGET_RPM=30 the real
 * interval is ~100ms, so there's large margin to push this threshold up.
 * 3ms wasn't enough (tested 2026-07-27: cut peak noise from RPM=6300 down
 * to RPM=540, but R still noisy vs. L's clean 0/60) - PWM runs at 1kHz
 * (1ms period), so switching noise can recur faster than a 3ms window
 * rejects. Raised to 15ms, still >>3x below the real ~50ms interval. */
#define MIN_PULSE_INTERVAL_US 15000

static volatile int64_t last_edge_us_left = 0;
static volatile int64_t last_edge_us_right = 0;

/* 2026-07-27, after fixing a bad encoder solder joint: with clean pulses,
 * RPM was still visibly jumping in fixed steps (0, 15, 30, 45...) with no
 * in-between values. Root cause: counting whole pulses in a fixed 200ms
 * window can only ever measure in units of "1 pulse / window" = 15 RPM -
 * a motor spinning at, say, 22 RPM is invisible to that method. Fixed by
 * also recording the time BETWEEN consecutive pulses (`last_interval_us`),
 * so control_task can compute RPM from timing instead of counting - the
 * standard "period measurement" tachometer technique, far finer resolution
 * at low speed than "frequency measurement" (pulse-counting) gives. */
static volatile int64_t last_interval_us_left = 0;
static volatile int64_t last_interval_us_right = 0;

typedef struct {
    volatile uint32_t *counter;
    volatile int64_t *last_edge_us;
    volatile int64_t *last_interval_us;
} encoder_isr_arg_t;

static encoder_isr_arg_t enc_left_arg  = { &pulse_count_left,  &last_edge_us_left,  &last_interval_us_left };
static encoder_isr_arg_t enc_right_arg = { &pulse_count_right, &last_edge_us_right, &last_interval_us_right };

/* One ISR handles both pins; `arg` tells it which counter/debounce-clock to use.
 * IRAM_ATTR: ISR code must live in IRAM so it still runs even while
 * flash cache is temporarily disabled (standard ESP-IDF requirement).
 * esp_timer_get_time() is documented safe to call from ISR context. */
static void IRAM_ATTR encoder_isr_handler(void *arg) {
    encoder_isr_arg_t *a = (encoder_isr_arg_t *)arg;
    int64_t now = esp_timer_get_time();
    int64_t since_last = now - *(a->last_edge_us);

    if (since_last < MIN_PULSE_INTERVAL_US) {
        return;   /* too soon to be a real slot transition - noise, drop it */
    }
    *(a->last_interval_us) = since_last;
    *(a->last_edge_us) = now;
    (*(a->counter))++;   /* only this otherwise. No math, no logging, no delays in an ISR. */
}

static void encoder_gpio_init(void) {
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << ENC_L_PIN) | (1ULL << ENC_R_PIN),
        .mode = GPIO_MODE_INPUT,
        /* GPIO34/35 are input-only pins anyway (can't drive internal
         * pull-up/down), and the LM393 module already has its own. */
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_POSEDGE,   /* rising edge only */
    };
    ESP_ERROR_CHECK(gpio_config(&io_conf));

    gpio_install_isr_service(0);
    gpio_isr_handler_add(ENC_L_PIN, encoder_isr_handler, (void *)&enc_left_arg);
    gpio_isr_handler_add(ENC_R_PIN, encoder_isr_handler, (void *)&enc_right_arg);
}

/* Raised to the true hardware ceiling 2026-08-24: confirmed live that PID
 * was maxing out at the old 100/200 cap (out of the LEDC's real 0-255
 * range) with RPM still reading 0 - wheels needed more than that to
 * overcome stall/friction, so the cap itself was the blocker, not a real
 * mechanical problem. VM has had its own dedicated powerbank wire since
 * 2026-07-24 (see README "Power Architecture"), so the original brownout
 * concern this cap was guarding against doesn't apply. No ceiling below
 * hardware max anymore - this bound only exists so a PID overshoot can't
 * cast a value above 255 into the uint32_t duty (undefined/wraps), not to
 * limit real power. */
#define MAX_SAFE_PWM 255.0f

/* No floor as of 2026-08-24 - confirmed the powerbank no longer needs the
 * artificial minimum current draw the old 10.0f floor existed for. True 0
 * is now reachable, so the robot can actually sit fully silent/still
 * instead of a constant faint motor whine at idle. That whine's real cause
 * (never fully root-caused, see README "Lessons Learned"): target_rpm
 * reaching pid_step() as a tiny non-zero float instead of bit-exact 0.0f
 * (e.g. from sync_trim) skips the target_rpm==0.0f bypass above and used
 * to fall through to this floor. Setting the floor itself to 0 removes
 * that symptom too, not just this constant's original intended case - the
 * lower bound stays here (not removed outright) purely so a negative `u`
 * can't underflow the uint32_t cast below, same reasoning as the ceiling. */
#define MIN_SAFE_PWM 0.0f

/* error(t) = target - actual; u(t) = Kp*error(t) + Ki*integral(t);
 * PWM = clamp(u(t), MIN_SAFE_PWM, MAX_SAFE_PWM). `integral` is per-wheel
 * state owned by the caller (control_task) since left/right run independent
 * loops - it persists across calls, unlike everything else in here.
 *
 * BUG FOUND 2026-07-27 (F5 first test): MIN_SAFE_PWM was clamping the
 * output even when target_rpm==0 - the F5 safety watchdog forces target
 * to 0 on a stale/missing /cmd_vel, but the floor was overriding that,
 * so the robot never actually stopped (kept driving on no command at all,
 * confirmed live - x drifted past 2m unattended). Explicit target==0
 * bypass added below: a commanded stop means PWM=0, full stop, no floor -
 * the floor only makes sense while the robot is supposed to be moving.
 * Also resets the integral so a long stop doesn't leave stale windup to
 * bias the next real command. */
static uint32_t pid_step(float target_rpm, float actual_rpm, float *integral) {
    if (target_rpm == 0.0f) {
        *integral = 0.0f;
        return 0;
    }

