ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
    float error = target_rpm - actual_rpm;
    float dt = CONTROL_PERIOD_MS / 1000.0f;
    float max_integral = g_max_i_contribution / g_ki;   /* live-tunable now, see g_kp/g_ki/g_max_i_contribution above */

    *integral += error * dt;
    if (*integral > max_integral)  *integral = max_integral;   /* anti-windup clamp */
    if (*integral < -max_integral) *integral = -max_integral;

    float u = g_kp * error + g_ki * (*integral);

    if (u < MIN_SAFE_PWM)   u = MIN_SAFE_PWM;   /* clamp: floor keeps current draw above the powerbank's auto-shutoff threshold */
    if (u > MAX_SAFE_PWM)   u = MAX_SAFE_PWM;   /* clamp: temporary current-safety ceiling, not the LEDC max */

    return (uint32_t)u;
}

/* Slew limiter (capped PWM change per cycle) REMOVED 2026-08-27 at vịt's
 * explicit request ("no annoying motor power or rotation speed cap") - it
 * existed to limit di/dt on a marginal power rail, but VM has had its own
 * dedicated powerbank wire since 2026-07-24 (see MAX_SAFE_PWM comment
 * above), which was the actual fix for that brownout risk; this was only
 * ever a secondary mitigation on top of it. Real trade-off being accepted:
 * PID output can now jump PWM instantly cycle-to-cycle instead of ramping,
 * which is a small step back toward the original brownout risk if VM's
 * wiring is ever disturbed - worth remembering if brownouts/resets reappear
 * in g_reset_reason/esp32_diag.
 *
 * Encoder read + PID + PWM write, all in ONE task/cycle — replaces the old
 * separate encoder_task (1 Hz) + pid_task (100 Hz). That split meant PID
 * recomputed 100x/sec against an RPM value that was up to 1 full second
 * stale. Running both halves in the same 20 Hz loop means PID always acts
 * on the reading from THIS cycle — zero cross-task staleness.
 * (CONTROL_PERIOD_MS itself now lives up near SLOTS_PER_REV - pid_step()
 * needs it too, and #define order matters in C.) */

/* Companion to the period-measurement RPM calc above: period measurement
 * alone can't distinguish "stopped" from "just hasn't ticked yet" - without
 * a timeout it would keep reporting the last (increasingly stale) interval
 * forever after the wheel actually stops. If no new pulse arrives within
 * this long, treat RPM as 0 instead. ~500ms is generous margin (~10x) over
 * the ~50ms/pulse interval expected near TARGET_RPM=60. */
#define RPM_STALE_US 500000

/* Silent-failure guard: if PWM is clearly high enough to move the wheel but
 * pulse count stays 0 for this many consecutive cycles, the encoder is
 * almost certainly dead (misaligned, unglued, wiring fault) rather than the
 * wheel legitimately being stopped. 20 cycles = 4s at 5Hz (was 1s at the old
 * 20Hz) — one slot alone only needs ~100ms at TARGET_RPM, so this still has
 * generous margin against false positives from startup transients. */
#define STALL_PWM_THRESHOLD 30.0f
#define STALL_CYCLE_LIMIT   20

static void control_task(void *arg) {
    encoder_gpio_init();

    uint32_t snapshot_left, snapshot_right;
    float applied_pwm_left = 0.0f, applied_pwm_right = 0.0f;
    /* Independent per-wheel integrators (restored) - see the speed
     * regulation block below for why this and IMU-based heading trim don't
     * fight each other the way a single shared-average loop did. */
    float integral_left = 0.0f, integral_right = 0.0f;
    uint32_t stall_cycles_left = 0, stall_cycles_right = 0;
    /* F4 pose lives in pose_x_shared/pose_y_shared/pose_theta_shared now
     * (F5 needs uros_task to read it) - origin = wherever the robot is at
     * boot/flash, all initialized 0 at file scope. */
    TickType_t last_wake = xTaskGetTickCount();
    const TickType_t period = pdMS_TO_TICKS(CONTROL_PERIOD_MS);

    while (1) {
        vTaskDelayUntil(&last_wake, period);

        int64_t now = esp_timer_get_time();
        int64_t last_edge_left, last_edge_right, interval_left, interval_right;

        portENTER_CRITICAL(&encoder_mux);
        snapshot_left = pulse_count_left;
        pulse_count_left = 0;
        snapshot_right = pulse_count_right;
        pulse_count_right = 0;
        /* int64_t isn't atomic on a 32-bit MCU (two word-writes) - read these
         * inside the same critical section as the pulse counts to avoid a
         * torn read racing the ISR mid-update. */
        last_edge_left   = last_edge_us_left;
        last_edge_right  = last_edge_us_right;
        interval_left    = last_interval_us_left;
        interval_right   = last_interval_us_right;
        portEXIT_CRITICAL(&encoder_mux);

        /* Odometry reset, requested from the dashboard's Reset All button
         * (2026-08-27) - previously the only way to zero the ESP32's own
         * (x,y,theta) was a physical reset. Zeroed here, before this cycle's
         * pose math runs, so the reset takes effect immediately rather than
         * one cycle's worth of stale delta being added to a nonzero base
         * first. */
        if (g_reset_odom_requested) {
            pose_x_shared = 0.0f;
            pose_y_shared = 0.0f;
            pose_theta_shared = 0.0f;
            g_heading_lock_active = false;   /* re-latch fresh against the new zero below */
            g_reset_odom_requested = false;
        }

        /* RPM from time between pulses, not pulses-per-window - see
         * last_interval_us / RPM_STALE_US comments above for why. */
        rpm_left_shared = (interval_left == 0 || (now - last_edge_left) > RPM_STALE_US)
                              ? 0.0f : 60000000.0f / (SLOTS_PER_REV * (float)interval_left);
        rpm_right_shared = (interval_right == 0 || (now - last_edge_right) > RPM_STALE_US)
                              ? 0.0f : 60000000.0f / (SLOTS_PER_REV * (float)interval_right);

        /* F4 odometry: how far each wheel moved THIS cycle (not cumulative),
         * then combine into how far the robot's center moved + how much it
         * turned. Midpoint integration (average current and new heading,
         * not just the old one) instead of plain Euler - at 200ms/cycle a
         * turning robot's heading can shift enough mid-cycle that using only
         * the pre-turn heading for the whole cycle's distance would visibly
         * bias x/y, especially while turning sharply. */
        float dist_left  = snapshot_left  * DISTANCE_PER_PULSE_M;
        float dist_right = snapshot_right * DISTANCE_PER_PULSE_M;
        float dist_center = (dist_left + dist_right) / 2.0f;
        float dt = CONTROL_PERIOD_MS / 1000.0f;

        /* Heading (2026-08-22): the encoder-differential dtheta below is
         * exactly what causes the documented ~-5 to -16deg wobble on a
         * nominally-straight command - wheel slip/quantization shows up
         * directly as false rotation. Prefer the gyro whenever the most
         * recent IMU read succeeded (no wheel-contact dependency at all);
         * snapshot both shared vars once, matching the pulse-count
         * snapshot pattern above, since uros_task writes them
         * concurrently. Falls back to pure encoder dtheta - the original,
         * already-proven formula - whenever the IMU hasn't initialized or
         * has latched dead (see imu_gz_valid_shared comment above): never
         * blend in a stale/failed gyro reading. */
        bool imu_gz_ok = imu_gz_valid_shared;
        float imu_gz_rad_per_s = imu_gz_rad_per_s_shared;
        float dtheta_encoder = (dist_right - dist_left) / WHEELBASE_M;
        float dtheta = imu_gz_ok ? (imu_gz_rad_per_s * dt) : dtheta_encoder;
        float theta_mid = pose_theta_shared + dtheta / 2.0f;

        pose_x_shared += dist_center * cosf(theta_mid);
        pose_y_shared += dist_center * sinf(theta_mid);
        pose_theta_shared += dtheta;

        /* Magnetometer fusion (2026-08-28): the gyro integration above
         * accumulates drift forever with nothing to correct it. Whenever a
         * valid compass heading is available, slowly drag pose_theta_shared
         * back toward it - complementary filter, see MAG_FUSION_WEIGHT
         * comment above. Angle-wrap-safe (compares the shortest way around
         * the circle, not raw subtraction, so it can't get a bogus huge
         * correction crossing the +/-180deg seam). */
        if (mag_heading_valid_shared) {
            float mag_diff = mag_heading_rad_shared - pose_theta_shared;
            if (mag_diff > PI_F)  mag_diff -= 2.0f * PI_F;
            if (mag_diff < -PI_F) mag_diff += 2.0f * PI_F;
            pose_theta_shared += MAG_FUSION_WEIGHT * mag_diff;
        }

        linear_vel_shared  = dist_center / dt;
        angular_vel_shared = dtheta / dt;

        /* F5: /cmd_vel -> per-wheel target RPM. Watchdog: stale command (or
         * none ever received) means 0, not "keep driving" - see
         * CMD_VEL_TIMEOUT_US comment above. */
        bool cmd_vel_fresh = (now - last_cmd_vel_us) <= CMD_VEL_TIMEOUT_US;
        float linear_x  = cmd_vel_fresh ? cmd_linear_x  : 0.0f;
        float angular_z = cmd_vel_fresh ? cmd_angular_z : 0.0f;

        float v_left_mps  = linear_x - angular_z * WHEELBASE_M / 2.0f;
        float v_right_mps = linear_x + angular_z * WHEELBASE_M / 2.0f;
        float target_rpm_left  = v_left_mps  / WHEEL_CIRCUMFERENCE_M * 60.0f;
        float target_rpm_right = v_right_mps / WHEEL_CIRCUMFERENCE_M * 60.0f;

        /* Heading lock: latch a target heading the instant we're not being
         * told to actively turn, then keep computing a virtual turn-rate
         * setpoint toward it every cycle - this is what makes the robot
         * fight back against drift/inertia slip even after cmd_vel goes to
         * (0,0), not just while a nonzero command is live. */
        bool commanding_turn = fabsf(angular_z) > ANGZ_TURN_DEADBAND;
        if (commanding_turn) {
            g_heading_lock_active = false;
        } else if (!g_heading_lock_active) {
            g_target_heading_rad = pose_theta_shared;
            g_heading_lock_active = true;
        }

