ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
        float angular_z_setpoint = angular_z;
        if (g_heading_lock_active) {
            float heading_error = wrap_angle_rad(g_target_heading_rad - pose_theta_shared);
            if (fabsf(heading_error) > HEADING_LOCK_DEADBAND_RAD) {
                angular_z_setpoint = g_kheading_lock * heading_error;
                if (angular_z_setpoint > g_max_heading_lock_rate)  angular_z_setpoint = g_max_heading_lock_rate;
                if (angular_z_setpoint < -g_max_heading_lock_rate) angular_z_setpoint = -g_max_heading_lock_rate;
            } else {
                angular_z_setpoint = 0.0f;
            }
        }

        /* Heading trim, in RPM units - shifts each wheel's OWN target below,
         * same domain as target_rpm_left/right so it composes with them by
         * plain addition. Computed the same way as before (rate loop vs the
         * IMU, fed by the position-lock setpoint above); what changed is
         * only where it lands - onto two independent per-wheel targets
         * instead of a shared averaged one. */
        float heading_trim_rpm = 0.0f;
        bool commanded_to_move = (fabsf(linear_x) > 0.001f) || (fabsf(angular_z_setpoint) > 0.001f);
        if (imu_gz_valid_shared && commanded_to_move) {
            float heading_rate_error = angular_z_setpoint - imu_gz_rad_per_s_shared;
            heading_trim_rpm = g_kheading * heading_rate_error;
            if (heading_trim_rpm > g_max_heading_trim_rpm)  heading_trim_rpm = g_max_heading_trim_rpm;
            if (heading_trim_rpm < -g_max_heading_trim_rpm) heading_trim_rpm = -g_max_heading_trim_rpm;
        }

        float signed_target_left  = target_rpm_left  - heading_trim_rpm;
        float signed_target_right = target_rpm_right + heading_trim_rpm;

        /* Direction pins, set every cycle from this cycle's target sign -
         * PID/PWM below only ever computes a MAGNITUDE (the single-channel
         * encoders can't report direction either, so actual_rpm is always
         * >=0 too), so direction has to be decided separately, from the
         * signed target above. AIN1=0/AIN2=1 (BIN1=0/BIN2=1) = forward, per
         * the flipped convention set in app_main - reverse is the opposite
         * pair. */
        gpio_set_level(AIN1_PIN, signed_target_left  < 0.0f ? 1 : 0);
        gpio_set_level(AIN2_PIN, signed_target_left  < 0.0f ? 0 : 1);
        gpio_set_level(BIN1_PIN, signed_target_right < 0.0f ? 1 : 0);
        gpio_set_level(BIN2_PIN, signed_target_right < 0.0f ? 0 : 1);

        /* Speed regulation: INDEPENDENT per-wheel PID (restored) - each
         * wheel converges to its OWN (heading-trimmed) target from its OWN
         * measured RPM, with its own integrator. This is what actually
         * fixes the Kp/Kheading coupling a shared-average loop had: Kp/Ki
         * only ever affect how hard a wheel's own loop chases ITS OWN
         * error, and heading correction only ever affects what that target
         * IS (via signed_target_left/right above) - there's no shared
         * output magnitude for the two to fight over, and no ratio-split
         * multiplication that lets Kp inadvertently scale heading
         * authority. A genuine hardware asymmetry (e.g. one motor with more
         * internal friction) is corrected at its actual source too: that
         * wheel's own PID sees its own RPM undershoot and pushes its own
         * PWM harder, independent of the other wheel entirely. */
        float target_pwm_left  = (float)pid_step(fabsf(signed_target_left),  rpm_left_shared,  &integral_left);
        float target_pwm_right = (float)pid_step(fabsf(signed_target_right), rpm_right_shared, &integral_right);

        /* Manual trim, added last - only while actually commanded to move
         * (real target or heading-lock correction, not a genuine stop), so
         * a commanded/watchdog stop still means true PWM=0 on both wheels
         * once heading error is also resolved, trim included. Clamped both
         * ends - trim could otherwise push this below 0 before the
         * uint32_t cast a few lines down, wrapping into a huge PWM value
         * instead of a small negative one. */
        if (commanded_to_move) {
            target_pwm_left  += g_trim_left;
            target_pwm_right += g_trim_right;
        }
        if (target_pwm_left  < 0.0f) target_pwm_left  = 0.0f;
        if (target_pwm_right < 0.0f) target_pwm_right = 0.0f;
        if (target_pwm_left  > MAX_SAFE_PWM) target_pwm_left  = MAX_SAFE_PWM;
        if (target_pwm_right > MAX_SAFE_PWM) target_pwm_right = MAX_SAFE_PWM;

        applied_pwm_left  = target_pwm_left;
        applied_pwm_right = target_pwm_right;
        pwm_left_shared  = applied_pwm_left;
        pwm_right_shared = applied_pwm_right;

        ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_0, (uint32_t)applied_pwm_left);
        ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_0);
        ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_1, (uint32_t)applied_pwm_right);
        ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_1);

        /* Stall watch, left wheel */
        if (applied_pwm_left > STALL_PWM_THRESHOLD && snapshot_left == 0) {
            stall_cycles_left++;
            if (stall_cycles_left == STALL_CYCLE_LIMIT) {
                ESP_LOGW(TAG, "LEFT encoder stall suspected: PWM=%.0f but 0 pulses for %ds",
                         applied_pwm_left, STALL_CYCLE_LIMIT * CONTROL_PERIOD_MS / 1000);
            }
        } else {
            stall_cycles_left = 0;
        }

        /* Stall watch, right wheel */
        if (applied_pwm_right > STALL_PWM_THRESHOLD && snapshot_right == 0) {
            stall_cycles_right++;
            if (stall_cycles_right == STALL_CYCLE_LIMIT) {
                ESP_LOGW(TAG, "RIGHT encoder stall suspected: PWM=%.0f but 0 pulses for %ds",
                         applied_pwm_right, STALL_CYCLE_LIMIT * CONTROL_PERIOD_MS / 1000);
            }
        } else {
            stall_cycles_right = 0;
        }

        /* NOTE (F5): once uros_task's custom transport claims UART0, this
         * won't show up on idf.py monitor anymore - debug via `ros2 topic
         * echo /odom` / `ros2 topic pub /cmd_vel` on the Jetson instead.
         * Left in place since it's harmless and still useful for standalone
         * bring-up before uros_task's transport takes over. */
        ESP_LOGI(TAG, "RPM L=%.1f R=%.1f  PWM L=%.0f R=%.0f  head_trim=%.1f  "
                      "pose x=%.3fm y=%.3fm theta=%.1fdeg",
                 rpm_left_shared, rpm_right_shared, applied_pwm_left, applied_pwm_right,
                 heading_trim_rpm, pose_x_shared, pose_y_shared, pose_theta_shared * 180.0f / PI_F);
    }
}

/* rclc_executor callback for the /cmd_vel subscription - just latches the
 * values and timestamps them for the watchdog. Runs in uros_task's context
 * (not an ISR), so no special atomicity concerns beyond the usual volatile. */
/* F5 diagnostics (2026-07-27): odometry was observed resetting toward 0
 * repeatedly during a real driving test, and the agent log showed the
 * micro-ROS client_key changing (new session) at the same time - strong
 * evidence the ESP32 itself is rebooting mid-drive, not just losing the
 * micro-ROS connection. Since console logging is muted (shares UART0 with
 * the transport - see esp_log_level_set below), there's no way to see a
 * reboot reason via idf.py monitor while /cmd_vel testing is happening.
 * Instead: read esp_reset_reason() once at boot (before anything else
 * runs) and publish it over the already-working micro-ROS link, so
 * `ros2 topic echo /esp32_diag` answers "was that a brownout?" without
 * needing the serial console at all. */
static esp_reset_reason_t g_reset_reason;

/* Populated once by i2c_scan_bus() (defined near setup_imu() below),
 * surfaced in /esp32_diag - lets us see what (if anything) actually ACKs
 * on the I2C bus without needing idf.py monitor (which can't run at the
 * same time as the micro-ROS agent, since both want exclusive UART0).
 * "unscanned" means setup_imu() never got far enough to run the scan
 * (bus creation itself failed). Declared up here, not next to
 * i2c_scan_bus() itself, because uros_task() (which reads it for the
 * diag string) is defined earlier in this file than setup_imu() - same
 * forward-reference trap as g_reset_reason above. */
static char g_i2c_scan_result[40] = "unscanned";

/* Which retry attempt (1-5) the IMU wake-up write succeeded on, 0 if never
 * attempted (bus/device setup itself failed), -1 if all 5 attempts failed.
 * Surfaced in /esp32_diag alongside g_i2c_scan_result - if this lands on
 * attempt 2-5 rather than always 1 or always -1, that's a strong signal of
 * a marginal/intermittent physical connection rather than a clean pass/fail. */
static int g_imu_wake_attempts = 0;

static const char *reset_reason_str(esp_reset_reason_t reason) {
    switch (reason) {
        case ESP_RST_POWERON:   return "POWERON";
        case ESP_RST_EXT:       return "EXT_PIN";
        case ESP_RST_SW:        return "SW_RESTART";
        case ESP_RST_PANIC:     return "PANIC";
        case ESP_RST_INT_WDT:   return "INT_WATCHDOG";
        case ESP_RST_TASK_WDT:  return "TASK_WATCHDOG";
        case ESP_RST_WDT:       return "OTHER_WATCHDOG";
        case ESP_RST_DEEPSLEEP: return "DEEPSLEEP_WAKE";
        case ESP_RST_BROWNOUT:  return "BROWNOUT";
        case ESP_RST_SDIO:      return "SDIO";
        default:                return "UNKNOWN";
    }
}

static void cmd_vel_callback(const void *msgin) {
    const geometry_msgs__msg__Twist *msg = (const geometry_msgs__msg__Twist *)msgin;
    cmd_linear_x    = (float)msg->linear.x;
    cmd_angular_z   = (float)msg->angular.z;
    last_cmd_vel_us = esp_timer_get_time();
}

/* Live PID gain updates (2026-08-27) - the dashboard publishes a plain text
 * command instead of a std_msgs/Float32MultiArray on purpose: this project's
 * micro-ROS build only has bounded-string sequences proven working (see
 * diag_msg/imu_msg), and a dynamic-array message type would need new
 * colcon.meta bounds + a full library rebuild to add mid-session - real risk
 * for zero benefit over just parsing three numbers out of a string. Malformed
 * text (wrong field count, e.g. a stale/partial message) is silently ignored
 * - gains only change on an unambiguous full match, never partially. */
static void pid_gains_callback(const void *msgin) {
    const std_msgs__msg__String *msg = (const std_msgs__msg__String *)msgin;
    /* Odometry-reset command shares this same already-proven channel rather
     * than adding a whole new subscription/entity for one rare button click
     * - same reasoning as this file's choice of plain text over a dynamic-
     * array message type above. Checked before the gains parse below so it
     * can never be mistaken for a (malformed) gains string. */
    if (strcmp(msg->data.data, "RESET_ODOM") == 0) {
        g_reset_odom_requested = true;
        return;
    }
    float kp, ki, max_i, khead, trim_l, trim_r, max_head, klock, max_lock;
    if (sscanf(msg->data.data, "KP=%f,KI=%f,MAXI=%f,KHEAD=%f,TRIML=%f,TRIMR=%f,MAXHEAD=%f,KLOCK=%f,MAXLOCK=%f",
               &kp, &ki, &max_i, &khead, &trim_l, &trim_r, &max_head, &klock, &max_lock) == 9) {
        g_kp = kp;
        g_ki = ki;
        g_max_i_contribution = max_i;
        g_kheading = khead;
        g_trim_left = trim_l;
        g_trim_right = trim_r;
        g_max_heading_trim_rpm = max_head;
        g_kheading_lock = klock;
        g_max_heading_lock_rate = max_lock;
    }
}

/* F5: connects to the micro-ROS agent, subscribes /cmd_vel, publishes /odom.
 * Structured the same way as the proven esp32/microros_hello.c pattern
 * (Week 1) - outer loop pings the agent and (re)creates everything on
 * connect, inner loop runs while the agent stays reachable, and everything
 * gets torn down and retried if the agent disappears.
 * No printf()/ESP_LOG calls anywhere in this function or its callers from
 * here on - confirmed live (2026-07-27) that ANY console write to UART0
 * corrupts the micro-ROS binary stream sharing the same wire, including
 * during the ping-agent phase. Silence is required, not just tidiness. */
static void uros_task(void *arg) {
    while (1) {
        while (rmw_uros_ping_agent(1000, 1) != RMW_RET_OK) {
            vTaskDelay(pdMS_TO_TICKS(500));
        }

        rcl_allocator_t allocator = rcl_get_default_allocator();
        rclc_support_t support;
        rcl_node_t node;
        rcl_subscription_t cmd_vel_sub;
        rcl_subscription_t pid_gains_sub;
        rcl_publisher_t odom_pub;
        rcl_publisher_t diag_pub;
        rcl_publisher_t imu_pub;
        rclc_executor_t executor;
        geometry_msgs__msg__Twist cmd_vel_msg;
        std_msgs__msg__String pid_gains_msg = {0};
        nav_msgs__msg__Odometry odom_msg = {0};
        std_msgs__msg__String diag_msg = {0};
        std_msgs__msg__String imu_msg = {0};
        char pid_gains_text[160];  /* was 64, then 128 -- too small once KHEAD/TRIML/TRIMR
                                     * (and now MAXHEAD, plus RESET_ODOM) were added to the
                                     * KP/KI/MAXI format (2026-08-27): the full field string
                                     * is already ~72+ bytes even at small values, so a too-
                                     * small buffer here means every /pid_gains update gets
                                     * silently truncated and fails pid_gains_callback's exact
                                     * sscanf match -- no gain change reaches the firmware,
                                     * with no error anywhere. Sized with real headroom this
                                     * time so adding one more field later doesn't repeat this. */
        char diag_text[400];   /* grown from 96/112/160/200/280/320 -- added TRIML/TRIMR fields plus
                                 * the existing RPM/PWM/KP/KI/MAXI/KHEAD/I2C/WAKE/GZ/MAG/MX/MY/MZ/
                                 * MAGHDG fields plus g_i2c_scan_result's own 40-char worst case can
                                 * exceed 200 */
        char imu_text[80];

        if (rclc_support_init(&support, 0, NULL, &allocator) != RCL_RET_OK) {
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_node_init_default(&node, "esp32_motor_node", "", &support) != RCL_RET_OK) {
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_subscription_init_default(&cmd_vel_sub, &node,
                ROSIDL_GET_MSG_TYPE_SUPPORT(geometry_msgs, msg, Twist), "cmd_vel") != RCL_RET_OK) {
            if (rcl_node_fini(&node) != RCL_RET_OK) {}
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_subscription_init_default(&pid_gains_sub, &node,
                ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, String), "pid_gains") != RCL_RET_OK) {
            if (rcl_subscription_fini(&cmd_vel_sub, &node) != RCL_RET_OK) {}
            if (rcl_node_fini(&node) != RCL_RET_OK) {}
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_publisher_init_default(&odom_pub, &node,
                ROSIDL_GET_MSG_TYPE_SUPPORT(nav_msgs, msg, Odometry), "odom") != RCL_RET_OK) {
            if (rcl_subscription_fini(&pid_gains_sub, &node) != RCL_RET_OK) {}
            if (rcl_subscription_fini(&cmd_vel_sub, &node) != RCL_RET_OK) {}
            if (rcl_node_fini(&node) != RCL_RET_OK) {}
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_publisher_init_default(&diag_pub, &node,
                ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, String), "esp32_diag") != RCL_RET_OK) {
            if (rcl_publisher_fini(&odom_pub, &node) != RCL_RET_OK) {}
            if (rcl_subscription_fini(&pid_gains_sub, &node) != RCL_RET_OK) {}
            if (rcl_subscription_fini(&cmd_vel_sub, &node) != RCL_RET_OK) {}
            if (rcl_node_fini(&node) != RCL_RET_OK) {}
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_publisher_init_default(&imu_pub, &node,
                ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, String), "imu_raw") != RCL_RET_OK) {
            if (rcl_publisher_fini(&diag_pub, &node) != RCL_RET_OK) {}
            if (rcl_publisher_fini(&odom_pub, &node) != RCL_RET_OK) {}
            if (rcl_subscription_fini(&pid_gains_sub, &node) != RCL_RET_OK) {}
            if (rcl_subscription_fini(&cmd_vel_sub, &node) != RCL_RET_OK) {}
            if (rcl_node_fini(&node) != RCL_RET_OK) {}
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }

