ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
        rclc_executor_t *exec = &executor;
        rclc_executor_init(exec, &support.context, 2, &allocator);
        rclc_executor_add_subscription(exec, &cmd_vel_sub, &cmd_vel_msg, &cmd_vel_callback, ON_NEW_DATA);
        rclc_executor_add_subscription(exec, &pid_gains_sub, &pid_gains_msg, &pid_gains_callback, ON_NEW_DATA);

        /* diag_text's CONTENT is now rebuilt every publish cycle (see the
         * publish block below) so /esp32_diag carries live per-wheel
         * RPM/PWM, not just the reset reason from connection time. The
         * buffer pointer/capacity themselves don't change per-message, so
         * only need to be set once here. pid_gains_msg's buffer likewise -
         * micro-ROS writes each incoming message into this same buffer, it's
         * not allocated fresh per-message. */
        diag_msg.data.data = diag_text;
        diag_msg.data.capacity = sizeof(diag_text);
        imu_msg.data.data = imu_text;
        imu_msg.data.capacity = sizeof(imu_text);
        pid_gains_msg.data.data = pid_gains_text;
        pid_gains_msg.data.capacity = sizeof(pid_gains_text);

        /* Set once - frame_id strings don't change per-message, only the
         * numeric fields below do. */
        odom_msg.header.frame_id.data = "odom";
        odom_msg.header.frame_id.size = strlen("odom");
        odom_msg.header.frame_id.capacity = odom_msg.header.frame_id.size + 1;
        odom_msg.child_frame_id.data = "base_link";
        odom_msg.child_frame_id.size = strlen("base_link");
        odom_msg.child_frame_id.capacity = odom_msg.child_frame_id.size + 1;

        TickType_t last_publish = xTaskGetTickCount();
        const TickType_t publish_period = pdMS_TO_TICKS(ODOM_PUBLISH_PERIOD_MS);
        bool agent_ok = true;

        while (agent_ok) {
            rclc_executor_spin_some(exec, RCL_MS_TO_NS(20));

            if (xTaskGetTickCount() - last_publish >= publish_period) {
                last_publish = xTaskGetTickCount();

                odom_msg.pose.pose.position.x = pose_x_shared;
                odom_msg.pose.pose.position.y = pose_y_shared;
                odom_msg.pose.pose.position.z = 0.0;

                /* Orientation as a quaternion, rotation about Z only (2D
                 * robot) - qz=sin(theta/2), qw=cos(theta/2), qx=qy=0. */
                float half_theta = pose_theta_shared / 2.0f;
                odom_msg.pose.pose.orientation.x = 0.0;
                odom_msg.pose.pose.orientation.y = 0.0;
                odom_msg.pose.pose.orientation.z = sinf(half_theta);
                odom_msg.pose.pose.orientation.w = cosf(half_theta);

                odom_msg.twist.twist.linear.x  = linear_vel_shared;
                odom_msg.twist.twist.angular.z = angular_vel_shared;

                if (rcl_publish(&odom_pub, &odom_msg, NULL) != RCL_RET_OK) {
                    agent_ok = false;
                }

                /* IMU sanity-check read (2026-08-14) - done inline here
                 * rather than in its own task: I2C at 400kHz for 14 bytes
                 * is on the order of tens of microseconds, negligible next
                 * to this loop's 100ms period, and doing it in-line means
                 * no shared volatile state and no ISR/task race to reason
                 * about at all - unlike pulse_count_left/right, which DO
                 * cross a real task boundary and need portENTER_CRITICAL. */
                int16_t imu_ax, imu_ay, imu_az, imu_gx, imu_gy, imu_gz;
                if (imu_read_raw(&imu_ax, &imu_ay, &imu_az,
                                  &imu_gx, &imu_gy, &imu_gz)) {
                    snprintf(imu_text, sizeof(imu_text),
                             "ax=%d ay=%d az=%d gx=%d gy=%d gz=%d",
                             imu_ax, imu_ay, imu_az, imu_gx, imu_gy, imu_gz);
                    /* gz <-> robot Z (yaw), empirically confirmed 2026-08-22:
                     * positive gz = turning left (CCW from above), matching
                     * control_task's existing encoder-differential dtheta
                     * sign exactly - no sign flip needed. Bias-subtracted
                     * (2026-08-28) - see g_gyro_z_bias_raw comment above for
                     * why an uncorrected zero-rate offset matters here. */
                    imu_gz_rad_per_s_shared = ((float)imu_gz - g_gyro_z_bias_raw) * GYRO_RAW_TO_RAD_PER_S;
                    imu_gz_valid_shared = true;
                } else {
                    snprintf(imu_text, sizeof(imu_text), "imu_read_failed");
                    imu_gz_valid_shared = false;
                }
                imu_msg.data.size = strlen(imu_text);
                if (rcl_publish(&imu_pub, &imu_msg, NULL) != RCL_RET_OK) {
                    agent_ok = false;
                }

                /* Magnetometer (2026-08-28): read alongside the existing
                 * IMU read above, same "inline, no separate task" reasoning
                 * (fast I2C transaction, no shared-state/ISR concerns).
                 * "Calibration" here is deliberately the simple version Alex
                 * asked for, not a full hard-iron spin calibration: take
                 * ONE reading right after boot and treat it as heading-zero.
                 * This works for this system specifically because nothing
                 * here needs a TRUE compass bearing - pose_theta_shared is
                 * already a relative/arbitrary reference (origin =
                 * wherever the robot is at boot, same as the gyro-only
                 * estimate always was), so a fixed, uncorrected hard-iron
                 * offset doesn't cause drift - it just means "heading 0"
                 * isn't true north, which nothing here depends on. Revisit
                 * with a real spin calibration ONLY if live testing shows
                 * the raw heading behaves inconsistently at different
                 * physical headings (the actual symptom of un-compensated
                 * hard-iron distortion) - see README.
                 * NOTE: unlike gz's sign (empirically confirmed 2026-08-22),
                 * this atan2f sign convention has NOT been verified on real
                 * hardware yet - check whether a rising heading value here
                 * actually matches "turning left" before trusting the fused
                 * pose_theta_shared, may need a sign flip. */
                int16_t mag_x = 0, mag_y = 0, mag_z = 0;
                if (mag_read_raw(&mag_x, &mag_y, &mag_z)) {
                    float raw_heading = atan2f((float)mag_y, (float)mag_x);
                    if (!g_mag_calibrated) {
                        g_mag_heading_offset_rad = raw_heading;
                        g_mag_calibrated = true;
                    }
                    float corrected = raw_heading - g_mag_heading_offset_rad;
                    if (corrected > PI_F)  corrected -= 2.0f * PI_F;
                    if (corrected < -PI_F) corrected += 2.0f * PI_F;
                    mag_heading_rad_shared = corrected;
                    mag_heading_valid_shared = true;
                } else {
                    mag_heading_valid_shared = false;
                }

